"""По введенным пользователем координатам двух точек вывести уравнение прямой вида y=kx+b, проходящей через эти точки.
"""

x1 = int(input("Введите значение X для первой точки - "))
y1 = int(input("Введите значение Y для первой точки - "))
x2 = int(input("Введите значение X для второй точки - "))
y2 = int(input("Введите значение Y для второй точки - "))

if x1 == x2 & y1 == y2:
    print("Введены одинаковые значения для 2-ух точек")
else:
    k = (y1-y2)/(x1-x2)
    b = (y2*x1-y1*x2)/(x1-x2)
    if all([(k == 0), (b == 0)]):
        print("y = 0")
    elif all([(k == 0), (b != 0)]):
        print("y = {:.2f}".format(b))
    elif b == 0:
        print("y = {:.2f}*x".format(k))
    elif b > 0:
        print("y = {:.2f}*x + {:.2f}".format(k, b))
    else:
        print("y = {:.2f}*x - {:.2f}".format(k, abs(b)))
